---
kind: method
id: M:Autodesk.Revit.DB.PlanViewRange.SetOffset(Autodesk.Revit.DB.PlanViewPlane,System.Double)
source: html/3ba94bad-a426-0f12-ba41-05f7cd0637bc.htm
---
# Autodesk.Revit.DB.PlanViewRange.SetOffset Method

Set the offset value associated with a View Depth plane

## Syntax (C#)
```csharp
public void SetOffset(
	PlanViewPlane planViewPlane,
	double offset
)
```

## Parameters
- **planViewPlane** (`Autodesk.Revit.DB.PlanViewPlane`) - View Depth plane
- **offset** (`System.Double`) - Offset value

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration